trade_exp/src/DataProcessors/Самообслуживание/Самообслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Самообслуживание</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ГрафикПоставокНаСклад/ГрафикПоставокНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b705356a-3674-4009-9b19-325f4f8d31b5">
  <name>ГрафикПоставокНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="76b53ffb-1cb8-4f02-8672-d6fb75f950f8">
    <name>Поток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="7d8d9c96-2e82-42e6-9eaa-77e664a95aa0">
    <name>ДатаВремяРазгрузкиПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="554d2043-23c2-4d8a-8d1f-7673b049aace">
    <name>ПродолжительностьРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="26c907b0-a3c4-480d-b8cf-9e1a032a4aea">
    <name>ДатаВремяПриездаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b09375dc-860d-4367-bc6f-b6ac98e85b4a">
    <name>КоличествоИспользуется</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="2e92b9a3-164e-497a-a5c9-88c89460f830">
    <name>АвторИзменений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dcbd2790-7240-447e-8d1d-bbebc3396ef2">
    <name>СогласованоСоСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a7ccbc1-15a7-4f8d-a54f-41f83a07c417">
    <name>ТекстПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="4e117ade-5a52-4e6e-9ee4-f1a871bf22bd">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c96af1ba-579e-4dd9-8e21-ed2ba80d3cad">
    <name>Оборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/DataProcessors/Самообслуживание/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПропускНаСклад") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_ПропускНаСклад",
		НСтр("ru = 'Пропуск на склад'"),
		СформироватьПечатнуюФормуПропускаНаСклад(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
		,
		"ПФ_MXL_ПропускНаСклад",
		"");
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуПропускаНаСклад(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, КомплектыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	МакетОбработки = ПолучитьМакет("ПФ_MXL_ПропускНаСклад");
	ОбластьШапка = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьТалон = МакетОбработки.ПолучитьОбласть("Талон");
	ОбластьШтрихкод = МакетОбработки.ПолучитьОбласть("Штрихкод");
	ОбластьЗаказ = МакетОбработки.ПолучитьОбласть("Заказ");

	Подразделение = "";
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	НомерДокумента = 0;
	//Вывод талона
	Для каждого Ссылка из МассивОбъектов Цикл			
		
		НомерДокумента = НомерДокумента + 1;
		ОбластьТалон.Параметры.НомерПоставщика = НомерДокумента;
		ОбластьТалон.Параметры.Поставщик = Ссылка.Контрагент;
		ОбластьТалон.Параметры.Склад = Ссылка.Склад;
		ОбластьТалон.Параметры.Секция = Ссылка.Секция;
		ОбластьТалон.Параметры.НомерЗаказа = ТолькоНомер(Ссылка.Номер);
		ДатаВремяЗагрузкиПлан = ПолучитьПлановуюДатуРазгрузкиЗаказа(Ссылка);
		ОбластьТалон.Параметры.ВремяРазгрузки = ДатаВремяЗагрузкиПлан;
		ОбластьТалон.Параметры.ДатаРазгрузки = ДатаВремяЗагрузкиПлан;	
		Подразделение = Ссылка.Подразделение;
		
		ТабличныйДокумент.Вывести(ОбластьТалон);
		
	КонецЦикла;	
	
	ДокЗаказ = МассивОбъектов[0];   
	//Механизм временно отключен до принятия нового решению по этому механизму 
	
	//Если ТипЗнч(ДокЗаказ) = Тип("ДокументСсылка.ЗаказПоставщику") и ЗначениеЗаполнено(ДокЗаказ.QRкод) Тогда 
	//	
	//	ОбластьQRкода = МакетОбработки.ПолучитьОбласть("ОбластьQRкода");;
	//	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(ДокЗаказ.QrКод, 1, 400);
	//  	КартинкаQRКода = Новый Картинка(ДанныеQRКода);
	// 	ОбластьQRкода.Рисунки.QRКод.Картинка = КартинкаQRКода;
	//	ТабличныйДокумент.Вывести(ОбластьQRкода); 
	//	
	//Иначе 

		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, МакетОбработки, ОбластьШтрихкод, МассивОбъектов[0]);
		ТабличныйДокумент.Вывести(ОбластьШтрихкод);  
		
	//КонецЕсли; 
	
	//Вывод заказа
	Для каждого Ссылка из МассивОбъектов Цикл			
		
		ОбластьЗаказ.Параметры.Поставщик = Ссылка.Контрагент;
		ОбластьЗаказ.Параметры.Склад = Ссылка.Склад;
		ОбластьЗаказ.Параметры.Секция = Ссылка.Секция;
		ОбластьЗаказ.Параметры.НомерЗаказа = ТолькоНомер(Ссылка.Номер);
		ДатаВремяЗагрузкиПлан = ПолучитьПлановуюДатуРазгрузкиЗаказа(Ссылка);
		ОбластьЗаказ.Параметры.ВремяРазгрузки = ДатаВремяЗагрузкиПлан;
		ОбластьЗаказ.Параметры.ДатаРазгрузки = ДатаВремяЗагрузкиПлан;	
		
		ТабличныйДокумент.Вывести(ОбластьЗаказ);
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, МакетОбработки, ОбластьШтрихкод, Ссылка);
		
		ТабличныйДокумент.Вывести(ОбластьШтрихкод);
	
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
	ТабличныйДокумент.ИмяПринтера = "CUSTOM TG2480-H";

	Если Подразделение = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Филиал Барнаул") Тогда
		ТабличныйДокумент.ИмяПринтера = "CUSTOM VKP80 II";
	КонецЕсли;

	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечатныойФормыПропуска(Рейс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	РейсОтПоставщикаРасчетДоставки.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка = &Ссылка
	|	И РейсОтПоставщикаРасчетДоставки.Ссылка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.ДокументОснование.Контрагент КАК Поставщик,
	|	ВТ_Заказы.ЗаказНаДоставку.АдресНаВыгрузке КАК АдресНаВыгрузке,
	|	ВТ_Заказы.ДокументОснование.Номер КАК НомерЗаказа,
	|	ВТ_Заказы.ДокументОснование.Ссылка КАК ЗаказПоставщику,
	|	ВТ_Заказы.ДокументОснование.Комментарий КАК Комментарий,
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяЗагрузкиПлан
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|		ПО ВТ_Заказы.ДокументОснование = ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику
	|
	|УПОРЯДОЧИТЬ ПО
	|	АдресНаВыгрузке,
	|	Поставщик,
	|	ДатаВремяЗагрузкиПлан";
	
	Запрос.УстановитьПараметр("Ссылка", Рейс);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьПлановуюДатуРазгрузкиЗаказа(ЗаказПоставщику)
	
	ДатаРазгрузки = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикПоставокНаСкладСрезПоследних.ДатаВремяРазгрузкиПлан КАК ДатаВремяЗагрузкиПлан
	|ИЗ
	|	РегистрСведений.ГрафикПоставокНаСклад.СрезПоследних КАК ГрафикПоставокНаСкладСрезПоследних
	|ГДЕ
	|	ГрафикПоставокНаСкладСрезПоследних.ЗаказПоставщику = &ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДатаРазгрузки = ВыборкаДетальныеЗаписи.ДатаВремяЗагрузкиПлан; 
	КонецЦикла;
	
	Возврат ДатаРазгрузки; 
	
КонецФункции

Функция ПолучитьРейсПоЗаказуПоставщику(ЗаказПоставщику)
	
	Рейс = Документы.РейсОтПоставщика.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.ДокументОснование = &ДокументОснование
	|	И РейсОтПоставщикаРасчетДоставки.Ссылка.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПоставщику);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рейс = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	Возврат Рейс;
	
КонецФункции

Функция ТолькоНомер(ВхНомер)
	Рез = СокрЛП(ВхНомер);
	Ном = СтрДлина(Рез);
	Пока Ном > 0 Цикл
		Если Найти("0123456789", Сред(Рез,Ном,1))=0 Тогда
			прервать;
		Иначе
			Ном = Ном - 1;
		КонецЕсли; 
	КонецЦикла; 
	Возврат ""+Число(Сред(Рез,Ном+1));
КонецФункции

#КонецЕсли
